In [1]:
from db import *
connection=se_connecter()
cursor=connection.cursor()

dept(ND, nom ,ville)<br>
emp(NE, nom, fonction, NEchef, dateEmb, sal, comm, ND)

In [2]:
dropTables(connection)
creationTables(connection)
insertionToDept(connection,dataDept)
insertIntoEmp(connection,dataEmp)
affiche_employe(connection,7900)

select * from emp where NE=7900
[(7900, 'SANA', 'SECRITAIRE', 7698, datetime.date(2006, 12, 3), 950.0, None, 30, 30, 'Vente', 'CASABLANCA')]

Question1

In [4]:
print("QUESTION 1")
executeRequete(connection,"select * from dept;")

QUESTION 1
(10, 'Comptabilite', 'RABAT')
(20, 'Recherche', 'MARRAKECH')
(30, 'Vente', 'CASABLANCA')
(40, 'Operations', 'AGADIR')

In [12]:
print("SUESTION 2")
executeRequete(connection,"select * from emp;")

SUESTION 2
(7369, 'ABDELILAH', 'SECRITAIRE', 7902, datetime.date(2005, 2, 17), 800.0, None, 20)
(7499, 'KAMAL', 'VENDEUR', 7698, datetime.date(2006, 2, 20), 1600.0, 300.0, 30)
(7521, 'SOAD', 'VENDEUR', 7698, datetime.date(2006, 2, 22), 1250.0, 500.0, 30)
(7566, 'ABDELKARIM', 'MANAGER', 7839, datetime.date(2006, 4, 2), 2975.0, None, 20)
(7654, 'IDRISS', 'VENDEUR', 7698, datetime.date(2006, 9, 28), 1250.0, 1400.0, 30)
(7698, 'JAOUAD', 'MANAGER', 7839, datetime.date(2006, 5, 1), 2850.0, None, 30)
(7782, 'MOHAMED', 'MANAGER', 7839, datetime.date(2006, 6, 9), 2450.0, None, 10)
(7788, 'ABDESSAMAD', 'ANALYSTE', 7566, datetime.date(2007, 9, 12), 3000.0, None, 20)
(7839, 'YASSINE', 'PRESIDENT', None, datetime.date(2006, 11, 17), 5000.0, None, 10)
(7844, 'TOURIYA', 'VENDEUR', 7698, datetime.date(2006, 9, 8), 1500.0, 0.0, 30)
(7876, 'JAMAL', 'SECRITAIRE', 7788, datetime.date(2008, 1, 12), 1100.0, None, 20)
(7900, 'SANA', 'SECRITAIRE', 7698, datetime.date(2006, 12, 3), 950.0, None, 30)
(7902, 'MUSTAPHA', 'ANALYSTE', 7566, datetime.date(2006, 3, 12), 3000.0, None, 20)

In [13]:
print("SUESTION 3")
executeRequete(connection,"select NE,nom,sal from emp order by sal desc;")

SUESTION 3
(7839, 'YASSINE', 5000.0)
(7788, 'ABDESSAMAD', 3000.0)
(7902, 'MUSTAPHA', 3000.0)
(7566, 'ABDELKARIM', 2975.0)
(7698, 'JAOUAD', 2850.0)
(7782, 'MOHAMED', 2450.0)
(7499, 'KAMAL', 1600.0)
(7844, 'TOURIYA', 1500.0)
(7521, 'SOAD', 1250.0)
(7654, 'IDRISS', 1250.0)
(7876, 'JAMAL', 1100.0)
(7900, 'SANA', 950.0)
(7369, 'ABDELILAH', 800.0)

In [71]:
print("SUESTION 4")
executeRequete(connection,"select NE, emp.nom from emp INNER JOIN dept where dept.ND=30 order by emp.nom ")

SUESTION 4
(7369, 'ABDELILAH')
(7566, 'ABDELKARIM')
(7788, 'ABDESSAMAD')
(7654, 'IDRISS')
(7876, 'JAMAL')
(7698, 'JAOUAD')
(7499, 'KAMAL')
(7782, 'MOHAMED')
(7902, 'MUSTAPHA')
(7900, 'SANA')
(7521, 'SOAD')
(7844, 'TOURIYA')
(7839, 'YASSINE')

In [4]:
executeRequete(connection,"describe dept")

('ND', b'int', 'NO', bytearray(b'PRI'), None, '')
('nom', b'varchar(20)', 'YES', bytearray(b''), None, '')
('ville', b'varchar(20)', 'YES', bytearray(b''), None, '')

In [4]:
executeRequete(connection,""" ALTER TABLE dept CHANGE nom name VARCHAR(20)""")

PAS de resultat pour cette requette

In [64]:
print("SUESTION 4")
executeRequete(connection,"select NE, nom from emp where ND=30 order by nom ")

SUESTION 4
(7654, 'IDRISS')
(7698, 'JAOUAD')
(7499, 'KAMAL')
(7900, 'SANA')
(7521, 'SOAD')
(7844, 'TOURIYA')

In [ ]:
print("SUESTION 4")
executeRequete(connection,"select NE, nom from emp where ND=30 order by nom ")

In [48]:
print("SUESTION 5")
executeRequete(connection,"""select nom,NE,fonction from emp where fonction <> "MANAGER" and dateEmb like "%2006%" """)

SUESTION 5
('KAMAL', 7499, 'VENDEUR')
('SOAD', 7521, 'VENDEUR')
('IDRISS', 7654, 'VENDEUR')
('YASSINE', 7839, 'PRESIDENT')
('TOURIYA', 7844, 'VENDEUR')
('SANA', 7900, 'SECRITAIRE')
('MUSTAPHA', 7902, 'ANALYSTE')

In [54]:
print("SUESTION 6")
executeRequete(connection,"""select fonction from emp """)

SUESTION 6
('SECRITAIRE',)
('VENDEUR',)
('VENDEUR',)
('MANAGER',)
('VENDEUR',)
('MANAGER',)
('MANAGER',)
('ANALYSTE',)
('PRESIDENT',)
('VENDEUR',)
('SECRITAIRE',)
('SECRITAIRE',)
('ANALYSTE',)

In [6]:
print("SUESTION 7")
executeRequete(connection,"""select NE, nom from emp NATURAL JOIN dept where ND in (30,20) and fonction="MANAGER" """)

SUESTION 7
(7566, 'ABDELKARIM')
(7698, 'JAOUAD')

In [7]:
print("SUESTION 8")

SUESTION 8

In [26]:
print("QUESTION 9")
executeRequete(connection,""" select distinct ND from emp e1 where e1.ND=10""")

QUESTION 9
(10,)

In [34]:
print("QUESTION 10")
executeRequete(connection,""" select nom from emp where NE in (select distinct NEchef from emp where NEchef is not NULL)""")

QUESTION 10
('ABDELKARIM',)
('JAOUAD',)
('ABDESSAMAD',)
('YASSINE',)
('MUSTAPHA',)

In [35]:
print("QUESTION autre version 10.1")
executeRequete(connection,""" select distinct e1.nom from emp e1 inner join emp e2 on e1.NE=e2.NEchef """)

QUESTION autre version 10.1
('ABDELKARIM',)
('JAOUAD',)
('ABDESSAMAD',)
('YASSINE',)
('MUSTAPHA',)

In [59]:
print("QUESTION autre version 10.2")
executeRequete(connection,""" with chefs as (select distinct NEchef as chef from emp where NEchef is not NULL ) select nom from emp,chefs where emp.NE=chefs.chef""")

QUESTION autre version 10.2
('ABDELKARIM',)
('JAOUAD',)
('ABDESSAMAD',)
('YASSINE',)
('MUSTAPHA',)

In [60]:
print("QUESTION autre version 10.3")
executeRequete(connection,""" with chefs as (select distinct NEchef as chef from emp where NEchef is not NULL ) select nom from emp INNER JOIN chefs on emp.NE=chefs.chef""")

QUESTION autre version 10.3
('ABDELKARIM',)
('JAOUAD',)
('ABDESSAMAD',)
('YASSINE',)
('MUSTAPHA',)

In [10]:
print("QUESTION autre 10.3: ")
executeRequete(connection,""" with chefs as (select distinct NEchef as chef from emp where NEchef is not NULL ) select nom from emp INNER JOIN chefs on emp.NE=chefs.chef""")

QUESTION autre 10.3:
('ABDELKARIM',)
('JAOUAD',)
('ABDESSAMAD',)
('YASSINE',)
('MUSTAPHA',)

In [22]:
print("QUESTION 12")
executeRequete(connection,"""
 select nom,sal,comm,sal+comm,fonction from emp where comm is not NULL
UNION
select nom,sal,comm,sal+0,fonction from emp where comm is NULL
""")

QUESTION 12
('KAMAL', 1600.0, 300.0, 1900.0, 'VENDEUR')
('SOAD', 1250.0, 500.0, 1750.0, 'VENDEUR')
('IDRISS', 1250.0, 1400.0, 2650.0, 'VENDEUR')
('TOURIYA', 1500.0, 0.0, 1500.0, 'VENDEUR')
('ABDELILAH', 800.0, None, 800.0, 'SECRITAIRE')
('ABDELKARIM', 2975.0, None, 2975.0, 'MANAGER')
('JAOUAD', 2850.0, None, 2850.0, 'MANAGER')
('MOHAMED', 2450.0, None, 2450.0, 'MANAGER')
('ABDESSAMAD', 3000.0, None, 3000.0, 'ANALYSTE')
('YASSINE', 5000.0, None, 5000.0, 'PRESIDENT')
('JAMAL', 1100.0, None, 1100.0, 'SECRITAIRE')
('SANA', 950.0, None, 950.0, 'SECRITAIRE')
('MUSTAPHA', 3000.0, None, 3000.0, 'ANALYSTE')

Une

In [21]:
print("QUESTION 13")
executeRequete(connection,""" select count(1) from  emp""")

QUESTION 13
(13,)

In [37]:
print("QUESTION 13")
executeRequete(connection,""" select count(1) from  emp where fonction="VENDEUR" """)

QUESTION 13
(4,)

In [59]:
print("QUESTION 15")
executeRequete(connection,"""with jobs as  (select distinct fonction from emp) select count(0) from jobs """)

QUESTION 15
(5,)

In [64]:
print("QUESTION 15")
executeRequete(connection,"""with rr as (select distinct fonction from emp) select sum(1) from rr""")

QUESTION 15
(Decimal('5'),)

In [65]:
print("QUESTION 16")
executeRequete(connection,""" select min(sal) as minsal,max(sal) as maxsal from emp""")

QUESTION 16
(800.0, 5000.0)

In [77]:
print("QUESTION 17")
executeRequete(connection,"""select fonction,count(*) from emp group by fonction """)

QUESTION 17
('SECRITAIRE', 3)
('VENDEUR', 4)
('MANAGER', 3)
('ANALYSTE', 2)
('PRESIDENT', 1)

In [78]:
print("QUESTION 18")
executeRequete(connection,"""select avg(sal) from emp where fonction="VENDEUR" """)

QUESTION 18
(1400.0,)

In [80]:
print("19. Salaires max dans chaque département (par numéro de département)")
executeRequete(connection,"""select ND,max(sal) from emp group by ND""")

19. Salaires max dans chaque département (par numéro de département)
(10, 5000.0)
(20, 3000.0)
(30, 2850.0)

In [96]:
print("20. Pourcentage moyen de la commission des vendeurs par rapport à leur salaire")
executeRequete(connection,""" select avg(100*(comm/sal)) from emp where fonction="VENDEUR" """)

20. Pourcentage moyen de la commission des vendeurs par rapport à leur salaire
(42.6875,)

In [156]:
print("21. Quels sont les départements dans lesquels travaillent plus de 3 personnes et quel est le salaire moyendans ces départements")
executeRequete(connection,""" with dbt as (with nbEmpByDept as (select ND,count(1) as nbEmployes from emp group by ND ) select ND as NND from  nbEmpByDept where nbEmployes >2) select emp.ND,avg(sal) from dbt,emp where dbt.NND=emp.ND group by emp.ND """)

21. Quels sont les départements dans lesquels travaillent plus de 3 personnes et quel est le salaire moyendans ces départements
(20, 2175.0)
(30, 1566.6666666666667)

In [165]:
print("21. Quels sont les départements dans lesquels travaillent plus de 3 personnes et quel est le salaire moyendans ces départements")
executeRequete(connection,""" select ND,avg(sal) as nbEmployes from emp group by ND having count(1)>2 """)

21. Quels sont les départements dans lesquels travaillent plus de 3 personnes et quel est le salaire moyendans ces départements
(20, 2175.0)
(30, 1566.6666666666667)

In [189]:
print("22. Nombre d’employés par département et profession avec le salaire moyen, min et max")
executeRequete(connection,""" select ND,fonction,count(*) as nbEmpl from emp as e group by ND,fonction order by ND,fonction """)

22. Nombre d’employés par département et profession avec le salaire moyen, min et max
(10, 'MANAGER', 1)
(10, 'PRESIDENT', 1)
(20, 'ANALYSTE', 2)
(20, 'MANAGER', 1)
(20, 'SECRITAIRE', 2)
(30, 'MANAGER', 1)
(30, 'SECRITAIRE', 1)
(30, 'VENDEUR', 4)

In [198]:
print("23. Noms des départements dans lesquels le salaire moyen dépasse 2000")
executeRequete(connection,""" select * from emp inner join on (emp.ND=) """)

23. Noms des départements dans lesquels le salaire moyen dépasse 2000
(10, 7782, 'MOHAMED', 'MANAGER', 7839, datetime.date(2006, 6, 9), 2450.0, None, 'Comptabilite', 'RABAT')
(10, 7839, 'YASSINE', 'PRESIDENT', None, datetime.date(2006, 11, 17), 5000.0, None, 'Comptabilite', 'RABAT')
(20, 7369, 'ABDELILAH', 'SECRITAIRE', 7902, datetime.date(2005, 2, 17), 800.0, None, 'Recherche', 'MARRAKECH')
(20, 7566, 'ABDELKARIM', 'MANAGER', 7839, datetime.date(2006, 4, 2), 2975.0, None, 'Recherche', 'MARRAKECH')
(20, 7788, 'ABDESSAMAD', 'ANALYSTE', 7566, datetime.date(2007, 9, 12), 3000.0, None, 'Recherche', 'MARRAKECH')
(20, 7876, 'JAMAL', 'SECRITAIRE', 7788, datetime.date(2008, 1, 12), 1100.0, None, 'Recherche', 'MARRAKECH')
(20, 7902, 'MUSTAPHA', 'ANALYSTE', 7566, datetime.date(2006, 3, 12), 3000.0, None, 'Recherche', 'MARRAKECH')
(30, 7499, 'KAMAL', 'VENDEUR', 7698, datetime.date(2006, 2, 20), 1600.0, 300.0, 'Vente', 'CASABLANCA')
(30, 7521, 'SOAD', 'VENDEUR', 7698, datetime.date(2006, 2, 22), 1250.0, 500.0, 'Vente', 'CASABLANCA')
(30, 7654, 'IDRISS', 'VENDEUR', 7698, datetime.date(2006, 9, 28), 1250.0, 1400.0, 'Vente', 'CASABLANCA')
(30, 7698, 'JAOUAD', 'MANAGER', 7839, datetime.date(2006, 5, 1), 2850.0, None, 'Vente', 'CASABLANCA')
(30, 7844, 'TOURIYA', 'VENDEUR', 7698, datetime.date(2006, 9, 8), 1500.0, 0.0, 'Vente', 'CASABLANCA')
(30, 7900, 'SANA', 'SECRITAIRE', 7698, datetime.date(2006, 12, 3), 950.0, None, 'Vente', 'CASABLANCA')

dept(ND, nom ,ville)<br>
emp(NE, nom, fonction, NEchef, dateEmb, sal, comm, ND)


24. Tous les employés travaillant à MARRAKECH
25. Tous les noms et dates d’embauche des employés embauchés avant leur supérieur hiérarchique avec le nom
et la date d’embauche de leurs managers
26. Tous les employés ne travaillant pas dans le même département que leur supérieur hiérarchique
27. Tous les employés qui gagnent plus que la moyenne.
28. Quel est le salaire moyen par département le plus élevé?
29. Tous les employés embauchés la même année que Yassine.
30. Tous les employés ayant le même manager que Touriya.
31. Liste des employés travaillant à RABAT et ayant le même job qu’ABDELKARIM.
32. Tous les employés du département Recherche embauchés le même jour que quelqu’un du département Vente
.
33. Tous les employés qui n’ont pas de subordonnés .
34. Tous les employés avec leur supérieur hiérarchique (et sa fonction), et leur département (avec le nom et la
ville), en affichant aussi les employés qui n’ont pas de supérieur hiérarchique.

In [15]:
connection.commit()
connection.close()